src/InformationRegisters/НоменклатураСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СпособыФормированияСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыФормированияСегментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПериодическиОбновлять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормироватьВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/НоменклатураСегмента/Forms/ФормаСпискаПоНоменклатуре/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура обработчик команды УдалитьИзСегмента
//
Процедура УдалитьИзСегмента(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьИзСегментаЗавершение", ЭтотОбъект), "Вы хотите удалить текущую номенклатуру из сегмента """ + Элементы.Список.ТекущиеДанные.Сегмент + """ ?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзСегментаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Элементы.Список.ТекущиеДанные = Неопределено И РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьНоменклатуруИзСегмента(Элементы.Список.ТекущиеДанные.Сегмент);
	ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды ДобавитьВСегмент
//
Процедура ДобавитьВСегмент(Команда)
	
	ПараметрыОткрытия = Новый Структура("Отбор", Новый Структура("СпособФормирования", ПеречислениеТипФормированияВРучную));
	Оповещение = Новый ОписаниеОповещения("ДобавитьВСегментЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаВыбора",
	ПараметрыОткрытия,,,,,
	Оповещение, 
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После добавления сегмента
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ДобавитьВСегментЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДобавитьНоменклатуруВСегмент(Результат);
		ОбновитьВидимостьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере" ФормыЭлемента
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
	
	ПеречислениеТипФормированияВРучную = Перечисления.СпособыФормированияСегментов.ФормироватьВручную;
	
КонецПроцедуры

&НаСервере
// Процедура удаление контрагент из сегмента
//
// Параметры:
//		Сегмент - Сегмент, с которого удалять контрагента
//
Процедура УдалитьНоменклатуруИзСегмента(Сегмент)
	
	МенеджерЗаписи = РегистрыСведений.НоменклатураСегмента.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сегмент = Сегмент;
	МенеджерЗаписи.Номенклатура = Параметры.Номенклатура;
	
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Удалить();
	
	МенеджерЗаписи.Записать();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
// Процедура добавление контрагент в сегмент
//
// Параметры:
//		Сегмент - Сегмент, в который добавить контрагента
//
Процедура ДобавитьНоменклатуруВСегмент(Сегмент)
	
	Если Сегмент.Пустая() Или Параметры.Номенклатура.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.НоменклатураСегмента.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сегмент = Сегмент;
	МенеджерЗаписи.Номенклатура = Параметры.Номенклатура;
	
	МенеджерЗаписи.Записать();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
// Процедура - обработчик события "Выбор" табличного поля.
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбранныеДанные = Элемент.ТекущиеДанные;
	Если ВыбранныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("Ключ", Элемент.ТекущиеДанные.Сегмент);
	ФормаСегмента = ПолучитьФорму("Справочник.СегментыНоменклатуры.ФормаОбъекта", СтруктураПараметров);
	ФормаСегмента.Открыть();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "СписокПриАктивизацииСтроки" табличного поля.
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура обновляет видимость и активность элементов формы.
//
Процедура ОбновитьВидимостьЭлементов()
	
	Элементы.ДобавитьВСегмент.Доступность = Истина;
	Элементы.УдалитьИзСегмента.Доступность = Истина;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Элементы.УдалитьИзСегмента.Доступность = Ложь;
	КонецЕсли;	
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено И Элементы.Список.ТекущиеДанные.СегментСпособФормирования <> ПеречислениеТипФормированияВРучную тогда
		Элементы.УдалитьИзСегмента.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти
